## dev
#### Terraform Initialization :gear: `success`
#### Terraform Plan :book: `success`

<details><summary>Show Plan</summary>

```terraform
module.GKE.module.vpc.google_compute_network.my_vpc: Refreshing state... [id=projects/logical-acolyte-423107-b5/global/networks/demo-vpc-1]
module.GKE.module.vpc.google_compute_address.nat: Refreshing state... [id=projects/logical-acolyte-423107-b5/regions/us-east1/addresses/cluster-nat]
module.GKE.module.subnet.google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/logical-acolyte-423107-b5/regions/us-east1/subnetworks/demo-private-subnet]
module.GKE.google_container_cluster.primary: Refreshing state... [id=projects/logical-acolyte-423107-b5/locations/us-east1/clusters/demo-dev]
module.GKE.module.node_pool.google_container_node_pool.primary_nodes: Refreshing state... [id=projects/logical-acolyte-423107-b5/locations/us-east1/clusters/demo-dev/nodePools/node-pool]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.GKE.module.node_pool.google_container_node_pool.primary_nodes has been deleted
  - resource "google_container_node_pool" "primary_nodes" {
        id             = "projects/logical-acolyte-423107-b5/locations/us-east1/clusters/demo-dev/nodePools/node-pool"
      - name           = "node-pool" -> null
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.GKE.google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ cluster_ipv4_cidr                        = "10.92.0.0/14" -> (known after apply)
      + datapath_provider                        = (known after apply)
      ~ default_max_pods_per_node                = 110 -> (known after apply)
      - enable_autopilot                         = false -> null
      ~ enable_intranode_visibility              = false -> (known after apply)
      - enable_tpu                               = false -> null
      ~ endpoint                                 = "34.139.30.163" -> (known after apply)
      ~ id                                       = "projects/logical-acolyte-423107-b5/locations/us-east1/clusters/demo-dev" -> (known after apply)
      ~ label_fingerprint                        = "a9dc16a7" -> (known after apply)
      ~ logging_service                          = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version                           = "1.29.4-gke.1043004" -> (known after apply)
      ~ monitoring_service                       = "monitoring.googleapis.com/kubernetes" -> (known after apply)
      ~ name                                     = "demo-dev" -> "demo-dev-1" # forces replacement
      ~ network                                  = "projects/logical-acolyte-423107-b5/global/networks/demo-vpc-1" -> "demo-vpc-1"
      ~ networking_mode                          = "VPC_NATIVE" -> (known after apply)
      ~ node_locations                           = [
          - "us-east1-b",
          - "us-east1-c",
          - "us-east1-d",
        ] -> (known after apply)
      ~ node_version                             = "1.29.4-gke.1043004" -> (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      ~ project                                  = "logical-acolyte-423107-b5" -> (known after apply)
      - resource_labels                          = {} -> null
      ~ self_link                                = "https://container.googleapis.com/v1/projects/logical-acolyte-423107-b5/locations/us-east1/clusters/demo-dev" -> (known after apply)
      ~ services_ipv4_cidr                       = "34.118.224.0/20" -> (known after apply)
      ~ subnetwork                               = "projects/logical-acolyte-423107-b5/regions/us-east1/subnetworks/demo-private-subnet" -> "demo-private-subnet"
      + tpu_ipv4_cidr_block                      = (known after apply)
        # (10 unchanged attributes hidden)

      ~ addons_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ authenticator_groups_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      - binary_authorization {
          - enabled         = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ cluster_autoscaling {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ confidential_nodes {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ cost_management_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ database_encryption {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ default_snat_status {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ gateway_api_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ identity_service_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ ip_allocation_policy {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ logging_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ master_auth {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ master_authorized_networks_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ mesh_certificates {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ monitoring_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      ~ node_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ node_pool {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ node_pool_auto_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ node_pool_defaults {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ notification_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      - private_cluster_config {
          - enable_private_endpoint     = false -> null
          - enable_private_nodes        = false -> null
          - private_endpoint            = "10.0.1.28" -> null
          - public_endpoint             = "34.139.30.163" -> null
            # (3 unchanged attributes hidden)

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      ~ release_channel {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ security_posture_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ service_external_ips_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ vertical_pod_autoscaling {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)

      ~ workload_identity_config {
          + allow_net_admin                          = (known after apply)
          + cluster_ipv4_cidr                        = (known after apply)
          + datapath_provider                        = (known after apply)
          + default_max_pods_per_node                = (known after apply)
          + deletion_protection                      = (known after apply)
          + description                              = (known after apply)
          + enable_autopilot                         = (known after apply)
          + enable_cilium_clusterwide_network_policy = (known after apply)
          + enable_intranode_visibility              = (known after apply)
          + enable_kubernetes_alpha                  = (known after apply)
          + enable_l4_ilb_subsetting                 = (known after apply)
          + enable_legacy_abac                       = (known after apply)
          + enable_shielded_nodes                    = (known after apply)
          + enable_tpu                               = (known after apply)
          + endpoint                                 = (known after apply)
          + id                                       = (known after apply)
          + initial_node_count                       = (known after apply)
          + label_fingerprint                        = (known after apply)
          + location                                 = (known after apply)
          + logging_service                          = (known after apply)
          + master_version                           = (known after apply)
          + min_master_version                       = (known after apply)
          + monitoring_service                       = (known after apply)
          + name                                     = (known after apply)
          + network                                  = (known after apply)
          + networking_mode                          = (known after apply)
          + node_locations                           = (known after apply)
          + node_version                             = (known after apply)
          + operation                                = (known after apply)
          + private_ipv6_google_access               = (known after apply)
          + project                                  = (known after apply)
          + remove_default_node_pool                 = (known after apply)
          + resource_labels                          = (known after apply)
          + self_link                                = (known after apply)
          + services_ipv4_cidr                       = (known after apply)
          + subnetwork                               = (known after apply)
          + tpu_ipv4_cidr_block                      = (known after apply)
        } -> (known after apply)
    }

  # module.GKE.module.node_pool.data.google_container_engine_versions.gke_version will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "gke_version" {
      + default_cluster_version         = (known after apply)
      + id                              = (known after apply)
      + latest_master_version           = (known after apply)
      + latest_node_version             = (known after apply)
      + location                        = "us-east1"
      + release_channel_default_version = (known after apply)
      + release_channel_latest_version  = (known after apply)
      + valid_master_versions           = (known after apply)
      + valid_node_versions             = (known after apply)
      + version_prefix                  = "1.29.4"
    }

  # module.GKE.module.node_pool.google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "demo-dev-1"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "test-policy-423107"
      + version                     = (known after apply)

      + management (known after apply)

      + network_config (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "test-policy-423107"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "gke-node",
              + "test-policy-423107-gke",
            ]

          + confidential_nodes (known after apply)

          + shielded_instance_config (known after apply)

          + workload_metadata_config (known after apply)
        }

      + upgrade_settings (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Pusher: @yanirw, Action: `pull_request`

Comment to apply these changes to the current environment